[
    {
        "id":"139",
        "speaker":"David Paquette",
        "bio":null,
        "email":"david.paquette@usask.ca",
        "website":"davepaquette.com\/",
        "twitter":"",
        "pic":"davidpaquette.jpg",
        "company":"P2 Energy Solutions",
        "location":"Calgary, AB"
    },
    {
        "id":"173",
        "speaker":"Brett Park",
        "bio":"Brett Park is one of the founders of Shiverware Interactive Software Developments Inc. Shiverware is a company founded on making interactive Apps for mobile devices. Brett has been lead developer for both of Shiverware's major releases: Musix and SpeakBeat. In order to stimulate the iOS community in Saskatchewan, Brett created the Saskatchewan iOS Group (SKiOS) which brings together marketers, developers, and designers to learn more about the iOS world. Brett also has experience with teaching mobile computing classes at the University of Regina. As well as his work with Shiverware, Brett is also pursuing his Ph.D in Computer Science at the University of Regina.",
        "email":"",
        "website":"",
        "twitter":"",
        "pic":"brettpark.jpg",
        "company":"Shiverware",
        "location":"Regina, SK"
    },
    {
        "id":"159",
        "speaker":"Tom Opgenorth",
        "bio":"Tom is long time software developer with 18 years of professional experience starting with a wide spectrum of platforms and technologies. He finds it very odd speaking of himself in the third person, but is doing so anyway. He is currently an independent consulting with a strong focus on Agile, Web and Mobile development based out of Edmonton, Alberta.",
        "email":"tom@opgenorth.net",
        "website":"www.opgenorth.net",
        "twitter":"topgenorth",
        "pic":"nopic.jpg",
        "company":"",
        "location":"Sherwood Park, AB"
    },
    {
        "id":"162",
        "speaker":"David Mosher",
        "bio":"Dave Mosher is a Front-End Engineer who has been designing and building web applications since using HTML tables for layout started to go out of style. A background in classical design and computer systems technology has enabled him to roam between between the worlds of design and development. Dave hails from Saskatoon, SK where he works as a freelance contractor and spends his free time running a Front-End focused user group called SaskJavaScript (<a href=http:\/\/www.saskjavascript.com target=_blank>www.saskjavascript.com<\/a>).",
        "email":"davidmosher@gmail.com",
        "website":"blog.davemo.com",
        "twitter":"dmosher",
        "pic":"davidmosher.jpg",
        "company":"DAVEMO Consulting",
        "location":"Saskatoon, SK"
    },
    {
        "id":"176",
        "speaker":"Jason Miller",
        "bio":null,
        "email":"",
        "website":"blogs.msmvps.com\/jmiller",
        "twitter":"jason_miller",
        "pic":"jasonmiller.jpg",
        "company":"Clear Concepts",
        "location":"Winnipeg, MB"
    },
    {
        "id":"177",
        "speaker":"Ruth Morton",
        "bio":"<p>Ruth Morton is a Technology Advisor for Microsoft Canada. Based in Guelph, Ontario, Ruth travels across Canada building relationships with IT managers and professionals, and talking about the latest in technology. She is a host for the AlignIT Manager Tech Talk series (www.microsoft.ca\/alignitshow) and writes on the Canadian IT Manager and Canadian IT Pro blogs (blogs.technet.com\/cdnitmanagers & blogs.technet.com\/canitpro).<\/p><p>Ruth is known for her authenticity, her ability to build trust and her knack for facilitating the connections and dialogue that matter most to those with whom she speaks. She gets inspired by the opportunity to open up people's minds to the possibilities of Microsoft, to their own potential, and how technology can impact the world.<\/p><p>Before joining Microsoft, Ruth worked as an IT professional for over 12 years implementing enterprise technologies and formulating IT strategies for organizations in Canada, Europe and the US.<\/p><p>For ways to connect with Ruth, please go to www.about.me\/ruthmorton.<\/p>",
        "email":"",
        "website":"",
        "twitter":"ruthm",
        "pic":"ruthmorton.jpg",
        "company":"Microsoft",
        "location":"Toronto, ON"
    },
    {
        "id":"175",
        "speaker":"Omer Qureshi",
        "bio":"Leading solution sales for the strategic and enterprise accounts segment in Northwest Territory for emerging business (vFabric & Cloud Foundry) @ VMware. The key accounts includes Starbucks, Nordstrom, Disney, Expedia, Costco, Nike, Columbia Sports and T-Mobile etc. The role requires building deep relationships with the CIO\/CTOs and with the key partners and service providers for landing GTM.",
        "email":"",
        "website":"",
        "twitter":"",
        "pic":"nopic.jpg",
        "company":"VMware",
        "location":"Seattle, WA"
    },
    {
        "id":"146",
        "speaker":"Steve Rogalsky",
        "bio":null,
        "email":"steve@rogalsky.ca",
        "website":"winnipegagilist.blogspot.com",
        "twitter":"srogalsky",
        "pic":"steverogalsky.jpg",
        "company":"Protegra",
        "location":"Winnipeg, MB"
    },
    {
        "id":"84",
        "speaker":"David Wesst",
        "bio":"David Wesst is a Senior User Experience Specialist at Imaginet based out of Winnipeg, Manitoba. Since earning his Bachelor of Computer Science, David has always been passionate about user experience and technology. He has continued to follow his passion by focusing his professional efforts on user interface and user experience development for all types of software over the past five years. Outside of development, David spends a great portion of his time working with the community to educate them on the importance of user experience. David is also an avid presenter at conferences ranging from Microsoft TechDays to smaller more intimate community events where he takes a practical look at HTML5 and how developers can use it to benefit the businesses they work for. Through his community work, David has earned the title of Microsoft MVP in the area of Internet Explorer and continues to educate the technology community about the latest in web standards and how to apply them in real-world scenarios.",
        "email":"david@wes.st",
        "website":"www.davidwesst.com",
        "twitter":"davidwesst",
        "pic":"davewesst.jpg",
        "company":"Imaginet",
        "location":"Winnipeg, MB"
    },
    {
        "id":"158",
        "speaker":"Dale Zack",
        "bio":"Dale Zak is mobile developer passionate about using technology for social change. Over the past four years he has contributed to open source communities like Ushahidi and FrontlineSMS, and currently working with UN OCHA to develop mobile apps to help with humanitarian response. Dale has also coordinated several social good initiatives including establishing Repurposed Labs to re-purpose used computers into public internet terminals for low income communities and deployed I Vote Because map to spark a pro-democracy movement why voting is important in Canada. His next endeavor is launching Whitespace Initiatives, a nonprofit organization whose mission is to bridge the gaps between groups in need with individuals with the skills to provide solutions.",
        "email":"",
        "website":"",
        "twitter":"dalezak",
        "pic":"dalezak.jpg",
        "company":"",
        "location":""
    },
    {
        "id":"140",
        "speaker":"Brent Watson",
        "bio":null,
        "email":"brent@brentwatson.com",
        "website":"",
        "twitter":"brent_watson",
        "pic":"brentwatson.jpg",
        "company":"Brent Watson Technologies Inc.",
        "location":"Regina, SK"
    },
    {
        "id":"155",
        "speaker":"Simon Timms",
        "bio":null,
        "email":"stimms@gmail.com",
        "website":"",
        "twitter":"stimms",
        "pic":"simontimms.jpg",
        "company":"",
        "location":"Calgary, AB"
    },
    {
        "id":"169",
        "speaker":"Eden Rohatensky",
        "bio":"Eden Rohatensky is a UX and graphic designer that has experience in both mobile and web. After leaving her position as a Mobile & Web Designer for GasBuddy.com, Eden moved on to work as a freelance web developer. She is also a Computer Science student at the University of Regina. Eden has worked closely with both the University of Regina's Computer Science Student Society and Regina's hackerspace, CrashBang Labs, to help build the development community around her.",
        "email":"edenrohatensky@gmail.com",
        "website":"",
        "twitter":"edenthecat",
        "pic":"edenrohatensky.jpg",
        "company":"Bravo Tango",
        "location":"Regina, SK"
    },
    {
        "id":"174",
        "speaker":"Darrel Sharpe",
        "bio":null,
        "email":"",
        "website":"",
        "twitter":"",
        "pic":"nopic.jpg",
        "company":"VMware",
        "location":""
    },
    {
        "id":"138",
        "speaker":"Chad McCallum",
        "bio":null,
        "email":"chadm@iqmetrix.com",
        "website":"www.rtigger.com",
        "twitter":"chademm",
        "pic":"chadmccallum.jpg",
        "company":"iQMetrix",
        "location":"Regina, SK"
    },
    {
        "id":"172",
        "speaker":"Thomas Lewis",
        "bio":null,
        "email":"",
        "website":"",
        "twitter":"tommylee",
        "pic":"tommylee.jpg",
        "company":"Microsoft",
        "location":"Vancouver, BC"
    },
    {
        "id":"144",
        "speaker":"James Chambers",
        "bio":null,
        "email":"james@jameschambers.com",
        "website":"jameschambers.com\/blog",
        "twitter":"CanadianJames",
        "pic":"jameschambers.jpg",
        "company":"",
        "location":"Brandon, MB"
    },
    {
        "id":"142",
        "speaker":"Chris Dagenais",
        "bio":null,
        "email":"mdchris@gmail.com",
        "website":"",
        "twitter":"mdchris",
        "pic":"nopic.jpg",
        "company":"\"Point2, A division of Yardi Systems\"",
        "location":"Saskatoon, SK"
    },
    {
        "id":"141",
        "speaker":"Melanie Cey",
        "bio":null,
        "email":"melanie.cey@gmail.com",
        "website":"",
        "twitter":"melaniemj",
        "pic":"melaniecey.jpg",
        "company":"\"Point2, A division of Yardi Systems\"",
        "location":"Saskatoon, SK"
    },
    {
        "id":"171",
        "speaker":"Jordan Boesch",
        "bio":"Jordan is an all around code monkey but monkeys around primarily with JavaScript - oooo ooo eee eee ahh ahh! He has contributed to the jQuery project, is an author at Learning jQuery (http:\/\/www.learningjquery.com) and writes a lot of fun plugins that help the open source world. Most of his time is spent on an online employee scheduling company he co-founded called 7shifts (www.7shifts.com). Server guy, backend hacker, front-end slasher and designer are just a few hats he wears while working on 7shifts.",
        "email":"",
        "website":"www.boedesign.com",
        "twitter":"jboesch",
        "pic":"jordanboesch.jpg",
        "company":"7Shifts",
        "location":"Regina, SK"
    },
    {
        "id":"151",
        "speaker":"Donald Belcham",
        "bio":null,
        "email":"donald.belcham@gmail.com",
        "website":"www.igloocoder.com",
        "twitter":"dbelcham",
        "pic":"donbelcham.jpg",
        "company":"igloocoder.com Consulting Inc.",
        "location":"Edmonton, AB"
    },
    {
        "id":"178",
        "speaker":"Brad Bird",
        "bio":"Coming Soon!",
        "email":"",
        "website":"",
        "twitter":"",
        "pic":"nopic.jpg",
        "company":"Cistel Technology Inc.",
        "location":"Ottawa, ON"
    },
    {
        "id":"164",
        "speaker":"Mike DeFehr",
        "bio":"Michael DeFehr is an independent SQL Server consultant doing business throught MDD Solutions Ltd. based in Winnipeg, Manitoba. His career has focused on database administration and development using Microsoft SQL Server. <br \/><br \/>A SQL Server MVP, Professional Engineer and Microsoft Certified Information Technology Professional in both Database Development and Administration, Mike has spent the past 15 years producing and maintaining database solutions. Mike specializes in the relational and storage engines and his solutions emphasize performance and simplicity.",
        "email":"mike@defehr.com",
        "website":"mikedefehr.com\/",
        "twitter":"mdefehr",
        "pic":"mikedefehr.jpg",
        "company":"",
        "location":"Winnipeg, MB"
    },
    {
        "id":"168",
        "speaker":"Tyler Doerksen",
        "bio":"Tyler Doerksen started developing software professionally in the days of .NET 1.1. Since then, he has worked on many different platforms including web, windows, mobile, and cloud computing. Tyler has been a Developer at Imaginet for over four years. In that time he has developed features for enterprise scale solutions, helping businesses achieve their goals through process improvement.<br \/><br \/>Tyler has a keen eye for efficiency and eliminating waste. Tyler will often walk the line between software and infrastructure with experience in Windows Server environments, IIS, and Hyper-V virtualization. He has been working with Windows Azure since its initial release and has become a cloud leader for Imaginet.",
        "email":"tylergd@gmail.com",
        "website":"tylerdev.wordpress.com\/",
        "twitter":"tyler_gd",
        "pic":"tylerdoerksen.jpg",
        "company":"Imaginet",
        "location":"Winnipeg, MB"
    },
    {
        "id":"145",
        "speaker":"James Kovacs",
        "bio":null,
        "email":"jkovacs@post.harvard.edu",
        "website":"jameskovacs.com",
        "twitter":"jameskovacs",
        "pic":"jameskovacs.jpg",
        "company":"JetBrains Inc",
        "location":"Calgary, AB"
    },
    {
        "id":"166",
        "speaker":"Nick Landry",
        "bio":null,
        "email":"",
        "website":"www.activenick.net",
        "twitter":"activenick",
        "pic":"nicklandry.jpg",
        "company":"Infragistics",
        "location":"Cranbury, NJ"
    },
    {
        "id":"154",
        "speaker":"Aaron Jones",
        "bio":null,
        "email":"aaron@jcc.ca",
        "website":"www.ajones.com\/blog\/",
        "twitter":"aaronjones",
        "pic":"nopic.jpg",
        "company":"AJones Co.",
        "location":"Regina, SK"
    },
    {
        "id":"170",
        "speaker":"Matt Haines",
        "bio":null,
        "email":"",
        "website":"",
        "twitter":"beardedinventor",
        "pic":"matthaines.jpg",
        "company":"iQMetrix",
        "location":"Regina, SK"
    },
    {
        "id":"161",
        "speaker":"Andrew Dyck",
        "bio":"Andrew Dyck is a data scientist based out of Regina and founder of Open Data Saskatchewan, a non-profit organization focused on promoting open data innovation in Saskatchewan. He is an author of research materials in several fields including economics, biology and statistics. Andrew views the coming era of big data as time of opportunity to better understand ourselves and solve many long-standing problems from agriculture to health care and everything in between.",
        "email":"",
        "website":"",
        "twitter":"",
        "pic":"nopic.jpg",
        "company":"",
        "location":""
    },
    {
        "id":"153",
        "speaker":"Amir Barylko",
        "bio":"Amir Barylko started his career in 1994 working for IBM as a senior developer while he was finishing his Masters degree in computer science. Since then he worked as team leader and architect for the past 15 years.<br \/><br \/>Having started with languages like C++ and Java he spent many years coding in C# and training other developers in topics such domain modeling, abstractions, patterns, automation, dependency injection, testing, etc.<br \/><br \/>Being an incurable geek, always thirsty for knowledge, his passion for technology moved him towards Ruby on Rails a few years ago, becoming an advocate of RoR web development and recently giving his first RoR training.<br \/><br \/>Amir is a rare combination of high technical skills, lots of experience in a wide range of platforms, exceptional presentation skills and great sense of humor. His presentations are always rich in content and fun to attend.",
        "email":"amir@barylko.com",
        "website":"www.orthocoders.com\/",
        "twitter":"abarylko",
        "pic":"amirbarylko.jpg",
        "company":"MavenThought",
        "location":"Winnipeg, MB"
    }
]